fn main() {
    // Массив
    let a = [1,2,3,4,5];
    let months = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"];
    let a1 = [3; 5];
    
    //Доступ к элементам массива
    let a = [1,2,3,4,5];
    let first = a[0];
    let second = a[1];
    
    //Недействительный доступ к элементу массива
    // let a = [1,2,3,4,5];
    // let index = 10;
    // let element = a[index];
    // println!("Значение элемента равно {}", element);
}
